In [1]:
import pandas as pd

In [2]:
cast=pd.read_csv("C://Users//aishw//Downloads//cast.csv")

In [3]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [4]:
data=cast.copy()

In [5]:
data

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3611207,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3611208,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3611209,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3611210,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3611211,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

##  how many movies are listed in title dataframe

In [6]:
data.title.value_counts().sum()

3611212

##  what are earliest two films listed in the titles  data frame

In [7]:
data.sort_values("year").head(2)['title']

2514470    Miss Jerry
555929     Miss Jerry
Name: title, dtype: object

In [8]:
data.sort_values('year').head(2)

,title,year,name,type,character,n
2514470,Miss Jerry,1894,Blanche Bayliss,actress,Miss Geraldine Holbrook (Miss Jerry),NaN
555929,Miss Jerry,1894,Chauncey Depew,actor,Himself - the Director of the New York Central...,NaN

## how many movies have the title "Hamlet"?

In [9]:
len(data[data.title=="Hamlet"])

313

In [10]:
data[data.title=="Hamlet"]

          title  year              name     type              character     n
1615     Hamlet  1996        Riz Abbasi    actor  Attendant to Claudius   1.0
7438     Hamlet  1921  Fritz Achterberg    actor            Fortinbras,   9.0
11242    Hamlet  2009      Hayden Adams    actor                Laertes   7.0
11243    Hamlet  2009      Hayden Adams    actor                 Player   7.0
13907    Hamlet  1913       Eric Adeney    actor               Reynaldo  14.0
...         ...   ...               ...      ...                    ...   ...
3505738  Hamlet  1969    Jennifer Tudor  actress             Court lady  23.0
3528322  Hamlet  2000      Diane Venora  actress               Gertrude   3.0
3557773  Hamlet  1996     Perdita Weeks  actress          Second Player  44.0
3562331  Hamlet  2015   Katie (II) West  actress                Ophelia   7.0
3578802  Hamlet  1996      Kate Winslet  actress                Ophelia  46.0

[313 rows x 6 columns]

##  how many movie are titled"North by Northwest"?

In [11]:
len(data[data.title=="North by Northwest"])

112

In [12]:
data[data.title=="North by Northwest"]

,title,year,name,type,character,n
12151,North by Northwest,1959,Stanley Adams,actor,Lieutenant Harding,NaN
27852,North by Northwest,1959,Andy Albin,actor,Farmer,NaN
54093,North by Northwest,1959,Don Anderson,actor,Worker,NaN
54307,North by Northwest,1959,Ernest Anderson,actor,Porter on Twentieth Century Ltd.,NaN
92195,North by Northwest,1959,Malcolm Atterbury,actor,Man at Prairie Crossing,NaN
...,...,...,...,...,...,...
3361396,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
3416124,North by Northwest,1959,Doris Singh,actress,First United Nations Receptionist,NaN
3437248,North by Northwest,1959,Helen Spring,actress,Bidder,NaN
3567500,North by Northwest,1959,Susan Whitney,actress,Attendant,NaN
3578877,North by Northwest,1959,Paula Winslowe,actress,Woman at Auction,NaN

## when was the first movie titled "hamlet" made?

In [13]:
data[data.title=="Hamlet"].sort_values('year').head(1)['year']

1545289    1910
Name: year, dtype: int64

### list all of the "Treasue Island" movie from earlist to most recent?

In [14]:
data[data.title=="Treasure Island"].sort_values('year')

,title,year,name,type,character,n
830114,Treasure Island,1918,Charles Gorman,actor,Prologue Player,NaN
840745,Treasure Island,1918,Joe Grant,actor,Undetermined child role,NaN
909157,Treasure Island,1918,Edwin Harley,actor,Prologue Player,NaN
3298306,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1715014,Treasure Island,1918,Lloyd Perl,actor,Black Dog,4.0
...,...,...,...,...,...,...
2420089,Treasure Island,1999,Caveh Zahedi,actor,Harold,9.0
1637661,Treasure Island,1999,Nick Offerman,actor,Samuel,2.0
1375015,Treasure Island,1999,J.P. Manoux,actor,Officer Hughes,18.0
1797264,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
307749,Treasure Island,1999,Bob Byington,actor,Thomas,12.0

### how many movies were made in year 1950?

In [15]:
len(data[data.year==1950])

22006

###  how many were made in year 1960?

In [16]:
len(data[data.year==1960])

18456

### how many movies were made from 1950 through 1959?

In [17]:
len(data[(data.year>=1950)&(data.year<=1959)])

210986

## In what years has the movie titled"Batman"been released?

In [18]:
data[data.title=='Batman'].sort_values('year')['year'].unique()

array([1943, 1989], dtype=int64)

## how many movie were there in there in the movie"Inception"?

In [19]:
len(data[data.title=="Inception"])

77

##   how many roles in the movie"Inception" are not ranked by an "n" value?

In [20]:
a = data[data.title=="Inception"]['n']

In [21]:
a.isnull().sum()

26

## how many roles in the movie "Inception" did receive an "n"value?

In [22]:
a = data[data.title=="Inception"]['n']

In [23]:
a.notnull().sum()

51

## display the cast of"North by Northwest" in their correct "n" value order ,ignoring roles that did not ear numeric"n" value?

In [24]:
data[data.title=="North by Northwest"].sort_values("n").dropna()

,title,year,name,type,character,n
840374,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3361396,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1404704,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3024085,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
343701,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2923056,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1634552,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1229083,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2357939,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1746383,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
642085,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2212083,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
447893,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1454363,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
198496,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1334726,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

## Display the entire cast in"n" order of the 1972 film "Sleuth"?

In [25]:
data[(data.title=="Sleuth")&(data.year==1972)].sort_values('n')

,title,year,name,type,character,n
1644328,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
314691,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
360365,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1412647,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2619278,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1396572,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

##  now display the entire cast in"n"-order of the 2007 version of "Sleuth"?

In [26]:
data[(data.title=="Sleuth")&(data.year==2007)].sort_values('n')

          title  year                 name     type          character    n
314692   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1246855  Sleuth  2007             Jude Law    actor               Milo  2.0
1741124  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
250297   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
360366   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2619277  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3223502  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

##  how many roles were credited in the silent 1921 version of 'Hamlet'?

In [27]:
len(data[(data.title=="Hamlet")&(data.year==1921)]['character'])

9

## how many roles were credited in Branagh's 1996 Hamlet?

In [28]:
len(data[(data.title=="Hamlet")&(data.year==1996)&(data.name=="Kenneth Branagh")])

1

###  how many "Hamlet" roles have been listed in all the film credits through history?

In [29]:
data[(data.title=="Hamlet")]['character'].nunique()

107

## how many people have played an "Ophelia"?

In [30]:
len(data[data.character=="Ophelia"])

111

In [31]:
data[data.character=="Ophelia"]['name'].nunique()

109

# how many pople played a role called"The Dude"?

In [32]:
len(data[data.character=="The Dude"])

18

## how many people have played a role called "The Stranger"?

In [33]:
data[data.character=="The Stranger"]['name'].nunique()

197

## how many roles has Sidney Poitier played throughout his career?

In [34]:
data[data.name=="Sidney Poitier"]['character'].unique()

array(['Gordon Ralfe', 'Manny Durrell', 'Walter Lee Younger',
       'Dr. Matt Younger', 'Sgt. Eddie Towler', 'Rau-Ru',
       'Gregory W. Miller', 'John Kane', 'Buck', 'Reverend Msimangu',
       'Toller', 'Tommy Tyler', 'Jack Parks', 'Inman Jackson',
       'Gates Watson', 'John Prentice', 'Virgil Tibbs', 'Clyde Williams',
       'Homer Smith', 'Roy Parmenter', 'Dr. Luther Brooks', 'Eddie Cook',
       'Porgy', 'Doctor', 'Robertson', 'Night Club Extra',
       'Warren Stantin', 'Donald Crease', 'Kimani Wa Karanja',
       'Ben Munceford', 'Noah Cullen', 'Simon of Cyrene',
       'FBI Deputy Director Carter Preston', 'Aly Mansuh', 'Jason Higgs',
       'Obam', 'Alan Newell', 'Shack Twala', 'Mark Thackeray',
       'Steve Jackson', 'Marcus'], dtype=object)

##  how many roles has Judi Dench played?

In [35]:
data[data.name=="Judi Dench"]['character'].nunique()

46

## List the supporting roles(having n=2)played by Cary Garnt in the 1940s, in order b year

In [40]:
data[(data.name=="Cary Grant")&(data.year==1940)&(data.n==2.0)]

                   title  year        name   type character    n
840371  My Favorite Wife  1940  Cary Grant  actor      Nick  2.0

##  list the leading roles that cary grant played in 1940 in order by year

In [37]:
data[(data.name=='Cary Grant')&(data.year==1940)]

,title,year,name,type,character,n
840353,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
840371,My Favorite Wife,1940,Cary Grant,actor,Nick,2.0
840397,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
840399,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

In [38]:
data[(data.name=='Cary Grant')&(data.year==1940)]['character']

840353          Walter Burns
840371                  Nick
840397           Matt Howard
840399    C. K. Dexter Haven
Name: character, dtype: object

# how many roles were avaliable for actor in the 1950?

In [39]:
data[data.year==1950].sort_values('character')['character'].nunique()

15007

## How many roles were avaliable for actoress in the 1950?

In [43]:
data[(data.type=="actress")&(data.year==1950)]['character'].nunique()

4052

## How many leading roles (n=1)were avaliable from the beginning of film history through 1980?

In [45]:
data[(data.n==1.0)&(data.year<=1980)]['character'].nunique()

51200

## how many non-leading roles were avaliable through from the beginning of film history through 1980

In [46]:
data[(data.n!=1.0)&(data.year<=1980)]['character'].nunique()

558711

## how many roles through 1980 were minor enough that they did not warrant a numeric"n" rank

In [47]:
a= data[(data.year<=1980)].fillna(0)

In [51]:
a[a.n==0].sort_values('character')['character'].nunique()

186116